Revit 2026 API

# Document Properties

---

The Document type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsReadOnly | Identifies if the object is read-only or modifiable.(Inherited from APIObject) |

#### Reference

Document Class

Autodesk.Revit.Creation Namespace